src/Catalogs/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Товары</name>
  <comment>Товары</comment>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UIDкартинкиТовара</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ДанныеМультимедиа/ДанныеМультимедиа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеМультимедиа</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.ТипХранимыхДанных</types>
    </type>
  </resources>
  <resources>
    <name>РазмерДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>UID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипХранимыхДанных/ТипХранимыхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипХранимыхДанных</name>
  <enumValues>
    <name>Видео</name>
    <comment>video/*</comment>
  </enumValues>
  <enumValues>
    <name>Аудио</name>
    <comment>audio/*</comment>
  </enumValues>
  <enumValues>
    <name>Фото</name>
    <comment>image/*</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Товары/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СделатьСнимок(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Если Объект.Ссылка.Пустая() Тогда
			Сообщить("Необходимо записать справочник сначала!");
			Возврат;
		КонецЕсли;
				
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(Камера) Тогда
			
			РазрешениеКамеры = Новый РазрешениеКамерыУстройства;
	       	РазрешениеКамеры.Высота = 480;
	       	РазрешениеКамеры.Ширина = 360;
						
			Результат = СредстваМультимедиа.СделатьФотоснимок(Камера,РазрешениеКамеры , Качество);
			ТипДанных = ПредопределенноеЗначение("Перечисление.ТипХранимыхДанных.Фото");
		Иначе
			Сообщить("Не поддерживается фото!");
		КонецЕсли;	
		
		Данные = Результат.ПолучитьДвоичныеДанные();
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Данные", Данные);
		СтруктураДанных.Вставить("РасширениеФайла", Результат.РасширениеФайла);
		СтруктураДанных.Вставить("ТипДанных", ПредопределенноеЗначение("Перечисление.ТипХранимыхДанных.Фото"));
		
		ЗаписатьДанныеВРегистр(СтруктураДанных);
		
		Картинка = ПоместитьВоВременноеХранилище(Данные);
		Элементы.Картинка.РазмерКартинки = РазмерКартинки.Пропорционально;
		ЭтаФорма.Модифицированность = Истина;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатМультимедиа(СтрМультимедиа)

	Если ОткрыватьРезультат Тогда
		Если Вопрос("Вы хотите просмотреть результат?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
		ОткрытьФорму("РегистрСведений.ДанныеМультимедиа.ФормаЗаписи",Новый Структура("СтрДанных", СтрМультимедиа));
	Иначе //иначе запишем данные в базу
		ЗаписатьДанныеВРегистр(СтрМультимедиа);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистр(Знач СтрМультимедиа)
	UID = Новый УникальныйИдентификатор;
	Рег = РегистрыСведений.ДанныеМультимедиа.СоздатьНаборЗаписей();
	
	Рег.Отбор.UID.Установить(UID);
	Рег.Отбор.Товар.Установить(Объект.Ссылка);
	
	Нов = Рег.Добавить();
	Нов.UID = UID;
	Нов.Товар = Объект.Ссылка;
	Нов.Данные = Новый ХранилищеЗначения(СтрМультимедиа.Данные);
	Нов.Период = ТекущаяДата();
	Нов.РазмерДанных = СтрМультимедиа.Данные.Размер();
	Нов.ТипДанных = СтрМультимедиа.ТипДанных;
	Нов.РасширениеФайла = СтрМультимедиа.РасширениеФайла;
	Рег.Записать(Истина);
	
	Объект.UIDкартинкиТовара = UID;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Качество = 100;
	#Если МобильноеПриложениеКлиент Тогда
		Камера = ТипКамерыУстройства.Авто;
		Картинка = ПоместитьВоВременноеХранилище(ПолучитьДанныеКартинки());
		Элементы.Картинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	#КонецЕсли
КонецПроцедуры

Функция ПолучитьДанныеКартинки()
	Возврат РегистрыСведений.ДанныеМультимедиа.ПолучитьДанныеФото(Объект.Ссылка, Объект.UIDкартинкиТовара);
КонецФункции

&НаКлиенте
Процедура УдалитьФото(Команда)
	УдалитьФотоНаСервере();
	Картинка = "";
КонецПроцедуры

&НаСервере
Процедура УдалитьФотоНаСервере()
	РегистрыСведений.ДанныеМультимедиа.УдалитьФото(Объект.Ссылка, Объект.UIDкартинкиТовара);
	Объект.UIDкартинкиТовара = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыборкаДопРеквизитов = ПроцедурыОбщегоНазначения.обПолучитьСписокДопРеквизитов(Метаданные.Справочники.Товары.Представление());
	ДобавитьРеквизитыНаФорму(ВыборкаДопРеквизитов);			
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму(ВыборкаДопРеквизитов)
	
	Пока ВыборкаДопРеквизитов.Следующий() Цикл
		ДобавляемыеРеквизиты = Новый Массив; 
		Если ВыборкаДопРеквизитов.ТипДанных = "Число" тогда
			КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
		    ОписаниеТипов = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		ИначеЕсли ВыборкаДопРеквизитов.ТипДанных = "Строка" тогда
			КвалификаторыСтроки = Новый КвалификаторыСтроки(50);
    		ОписаниеТипов = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		Иначе	
			ОписаниеТипов = Новый ОписаниеТипов(ВыборкаДопРеквизитов.ТипДанных);
		КонецЕсли;
		
	    Реквизит = Новый РеквизитФормы(ВыборкаДопРеквизитов.Реквизит, ОписаниеТипов); 
	    ДобавляемыеРеквизиты.Добавить(Реквизит); 
	    ИзменитьРеквизиты(ДобавляемыеРеквизиты); 		
	    Элемент = ЭтаФорма.Элементы.Добавить(ВыборкаДопРеквизитов.Реквизит, Тип("ПолеФормы"), ЭтаФорма.Элементы.ДопРеквизиты); 
	    Элемент.Вид = ВидПоляФормы.ПолеВвода; 
	    Элемент.ПутьКДанным = ВыборкаДопРеквизитов.Реквизит; 
	    Элемент.РастягиватьПоГоризонтали = Истина;
	    Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элемент.Заголовок = СтрЗаменить(Элемент.Имя,"ДопРеквизит_","");
	    ЭтаФорма.Элементы[ВыборкаДопРеквизитов.Реквизит].КнопкаОчистки = Истина;
	    ЭтаФорма.Элементы[ВыборкаДопРеквизитов.Реквизит].КнопкаВыбора  = Истина;
		
		НайденнаяСтрока = Неопределено;
		МассивСтрок = Объект.ДопРеквизиты.НайтиСтроки(Новый Структура("Реквизит", ВыборкаДопРеквизитов.Реквизит));
		Если МассивСтрок.Количество() > 0 Тогда
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если Не НайденнаяСтрока = Неопределено Тогда
			ЭтаФорма[ВыборкаДопРеквизитов.Реквизит] = НайденнаяСтрока.Значение;	
		КонецЕсли;
				
	    Элемент.УстановитьДействие("ПриИзменении","ИзменениеДопРеквизитов");
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДопРеквизитов()
	
	МассивСтрок = Объект.ДопРеквизиты.НайтиСтроки(Новый Структура("Реквизит", ЭтаФорма.ТекущийЭлемент.Имя));
	Если МассивСтрок.Количество() > 0 Тогда
	      НайденнаяСтрока = МассивСтрок[0];
	КонецЕсли;
		
	Если НайденнаяСтрока = Неопределено Тогда
		НоваяСтрока = Объект.ДопРеквизиты.Добавить();
		НоваяСтрока.Реквизит = ЭтаФорма.ТекущийЭлемент.Имя;
		НоваяСтрока.Значение = ЭтаФорма[ЭтаФорма.ТекущийЭлемент.Имя];
	Иначе
		НайденнаяСтрока.Значение = ЭтаФорма[ЭтаФорма.ТекущийЭлемент.Имя];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Необходимо записать справочник сначала!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.UIDкартинкиТовара) Тогда
		Сообщить("Фото не найдено. Не возможно открыть фото!");
		Возврат;
	КонецЕсли;
КонецПроцедуры
